simoore/lwip-server/src/stm32h7/Vectors.cpp
#include <cstdint>

// This stores the initial value of the stack pointer. It is defined in the linker script. The stack pointer is 
// located at the very end of one of the RAM memories. In the case of the STM32H7, it is located at the end of the
// RAM_D1 memory.
extern char _estack;

// The entry point of the application on a power cycle or restart. It is defined in Startup.cpp.
extern "C" void Reset_Handler();

// Attributes of the default weak definitions of the interrupts handlers in STM32H7.
// https://gcc.gnu.org/onlinedocs/gcc-11.1.0/gcc/Common-Function-Attributes.html#Common-Function-Attributes
#define DEFAULT_INTERRUPT extern "C" __attribute__((weak))

/*****************************************************************************/
/******** DEFAULT INTERRUPT DEFINITIONS **************************************/
/*****************************************************************************/     

DEFAULT_INTERRUPT void NMI_Handler()                    { while (true); }   // NMI_Handler                    
DEFAULT_INTERRUPT void HardFault_Handler()              { while (true); }   // HardFault_Handler
DEFAULT_INTERRUPT void MemManage_Handler()              { while (true); }   // MemManage_Handler
DEFAULT_INTERRUPT void BusFault_Handler()               { while (true); }   // BusFault_Handler
DEFAULT_INTERRUPT void UsageFault_Handler()             { while (true); }   // UsageFault_Handler
DEFAULT_INTERRUPT void SVC_Handler()                    { while (true); }   // SVC_Handler
DEFAULT_INTERRUPT void DebugMon_Handler()               { while (true); }   // DebugMon_Handler
DEFAULT_INTERRUPT void PendSV_Handler()                 { while (true); }   // PendSV_Handler
DEFAULT_INTERRUPT void SysTick_Handler()                { while (true); }   // SysTick_Handler

DEFAULT_INTERRUPT void WWDG_IRQHandler()                { while (true); }   // Window WatchDog                                                
DEFAULT_INTERRUPT void PVD_AVD_IRQHandler()             { while (true); }   // PVD/AVD through EXTI Line detection                      
DEFAULT_INTERRUPT void TAMP_STAMP_IRQHandler()          { while (true); }   // Tamper and TimeStamps through the EXTI line        
DEFAULT_INTERRUPT void RTC_WKUP_IRQHandler()            { while (true); }   // RTC Wakeup through the EXTI line                      
DEFAULT_INTERRUPT void FLASH_IRQHandler()               { while (true); }   // FLASH                                                                 
DEFAULT_INTERRUPT void RCC_IRQHandler()                 { while (true); }   // RCC                                                                    
DEFAULT_INTERRUPT void EXTI0_IRQHandler()               { while (true); }   // EXTI Line0                                           
DEFAULT_INTERRUPT void EXTI1_IRQHandler ()              { while (true); }   // EXTI Line1                                             
DEFAULT_INTERRUPT void EXTI2_IRQHandler()               { while (true); }   // EXTI Line2                                             
DEFAULT_INTERRUPT void EXTI3_IRQHandler()               { while (true); }   // EXTI Line3                                             
DEFAULT_INTERRUPT void EXTI4_IRQHandler()               { while (true); }   // EXTI Line4                                             
DEFAULT_INTERRUPT void DMA1_Stream0_IRQHandler()        { while (true); }   // DMA1 Stream 0                                  
DEFAULT_INTERRUPT void DMA1_Stream1_IRQHandler()        { while (true); }   // DMA1 Stream 1                                   
DEFAULT_INTERRUPT void DMA1_Stream2_IRQHandler()        { while (true); }   // DMA1 Stream 2                                   
DEFAULT_INTERRUPT void DMA1_Stream3_IRQHandler()        { while (true); }   // DMA1 Stream 3                                   
DEFAULT_INTERRUPT void DMA1_Stream4_IRQHandler()        { while (true); }   // DMA1 Stream 4                                   
DEFAULT_INTERRUPT void DMA1_Stream5_IRQHandler()        { while (true); }   // DMA1 Stream 5                                   
DEFAULT_INTERRUPT void DMA1_Stream6_IRQHandler()        { while (true); }   // DMA1 Stream 6                                   
DEFAULT_INTERRUPT void ADC_IRQHandler()                 { while (true); }   // ADC1, ADC2 and ADC3s                            
DEFAULT_INTERRUPT void FDCAN1_IT0_IRQHandler()          { while (true); }   // FDCAN1 interrupt line 0                          
DEFAULT_INTERRUPT void FDCAN2_IT0_IRQHandler()          { while (true); }   // FDCAN2 interrupt line 0                          
DEFAULT_INTERRUPT void FDCAN1_IT1_IRQHandler()          { while (true); }   // FDCAN1 interrupt line 1                          
DEFAULT_INTERRUPT void FDCAN2_IT1_IRQHandler()          { while (true); }   // FDCAN2 interrupt line 1                          
DEFAULT_INTERRUPT void EXTI9_5_IRQHandler()             { while (true); }   // External Line[9:5]s                                    
DEFAULT_INTERRUPT void TIM1_BRK_IRQHandler()            { while (true); }   // TIM1 Break interrupt                  
DEFAULT_INTERRUPT void TIM1_UP_IRQHandler()             { while (true); }   // TIM1 Update interrupt                 
DEFAULT_INTERRUPT void TIM1_TRG_COM_IRQHandler()        { while (true); }   // TIM1 Trigger and Commutation interrupt 
DEFAULT_INTERRUPT void TIM1_CC_IRQHandler()             { while (true); }   // TIM1 Capture Compare                                   
DEFAULT_INTERRUPT void TIM2_IRQHandler()                { while (true); }   // TIM2                                            
DEFAULT_INTERRUPT void TIM3_IRQHandler()                { while (true); }   // TIM3                                            
DEFAULT_INTERRUPT void TIM4_IRQHandler()                { while (true); }   // TIM4                                            
DEFAULT_INTERRUPT void I2C1_EV_IRQHandler()             { while (true); }   // I2C1 Event                                             
DEFAULT_INTERRUPT void I2C1_ER_IRQHandler()             { while (true); }   // I2C1 Error                                             
DEFAULT_INTERRUPT void I2C2_EV_IRQHandler()             { while (true); }   // I2C2 Event                                             
DEFAULT_INTERRUPT void I2C2_ER_IRQHandler()             { while (true); }   // I2C2 Error                                               
DEFAULT_INTERRUPT void SPI1_IRQHandler()                { while (true); }   // SPI1                                            
DEFAULT_INTERRUPT void SPI2_IRQHandler()                { while (true); }   // SPI2                                            
DEFAULT_INTERRUPT void USART1_IRQHandler()              { while (true); }   // USART1                                          
DEFAULT_INTERRUPT void USART2_IRQHandler()              { while (true); }   // USART2                                          
DEFAULT_INTERRUPT void USART3_IRQHandler()              { while (true); }   // USART3                                          
DEFAULT_INTERRUPT void EXTI15_10_IRQHandler()           { while (true); }   // External Line[15:10]                                  
DEFAULT_INTERRUPT void RTC_Alarm_IRQHandler()           { while (true); }   // RTC Alarm (A and B) through EXTI Line                                      
DEFAULT_INTERRUPT void TIM8_BRK_TIM12_IRQHandler()      { while (true); }   // TIM8 Break and TIM12                  
DEFAULT_INTERRUPT void TIM8_UP_TIM13_IRQHandler()       { while (true); }   // TIM8 Update and TIM13                 
DEFAULT_INTERRUPT void TIM8_TRG_COM_TIM14_IRQHandler()  { while (true); }   // TIM8 Trigger and Commutation and TIM14 
DEFAULT_INTERRUPT void TIM8_CC_IRQHandler()             { while (true); }   // TIM8 Capture Compare                                   
DEFAULT_INTERRUPT void DMA1_Stream7_IRQHandler()        { while (true); }   // DMA1 Stream7                                           
DEFAULT_INTERRUPT void FMC_IRQHandler()                 { while (true); }   // FMC                                             
DEFAULT_INTERRUPT void SDMMC1_IRQHandler()              { while (true); }   // SDMMC1                                          
DEFAULT_INTERRUPT void TIM5_IRQHandler()                { while (true); }   // TIM5                                            
DEFAULT_INTERRUPT void SPI3_IRQHandler()                { while (true); }   // SPI3                                            
DEFAULT_INTERRUPT void UART4_IRQHandler()               { while (true); }   // UART4                                           
DEFAULT_INTERRUPT void UART5_IRQHandler()               { while (true); }   // UART5                                           
DEFAULT_INTERRUPT void TIM6_DAC_IRQHandler()            { while (true); }   // TIM6 and DAC1&2 underrun errors                    
DEFAULT_INTERRUPT void TIM7_IRQHandler()                { while (true); }   // TIM7                         
DEFAULT_INTERRUPT void DMA2_Stream0_IRQHandler()        { while (true); }   // DMA2 Stream 0                                   
DEFAULT_INTERRUPT void DMA2_Stream1_IRQHandler()        { while (true); }   // DMA2 Stream 1                                   
DEFAULT_INTERRUPT void DMA2_Stream2_IRQHandler()        { while (true); }   // DMA2 Stream 2                                   
DEFAULT_INTERRUPT void DMA2_Stream3_IRQHandler()        { while (true); }   // DMA2 Stream 3                                   
DEFAULT_INTERRUPT void DMA2_Stream4_IRQHandler()        { while (true); }   // DMA2 Stream 4                                   
DEFAULT_INTERRUPT void ETH_IRQHandler()                 { while (true); }   // Ethernet                                        
DEFAULT_INTERRUPT void ETH_WKUP_IRQHandler()            { while (true); }   // Ethernet Wakeup through EXTI line                      
DEFAULT_INTERRUPT void FDCAN_CAL_IRQHandler()           { while (true); }   // FDCAN calibration unit interrupt                                                               
DEFAULT_INTERRUPT void DMA2_Stream5_IRQHandler()        { while (true); }   // DMA2 Stream 5                                   
DEFAULT_INTERRUPT void DMA2_Stream6_IRQHandler()        { while (true); }   // DMA2 Stream 6                                   
DEFAULT_INTERRUPT void DMA2_Stream7_IRQHandler()        { while (true); }   // DMA2 Stream 7                                   
DEFAULT_INTERRUPT void USART6_IRQHandler()              { while (true); }   // USART6                                           
DEFAULT_INTERRUPT void I2C3_EV_IRQHandler()             { while (true); }   // I2C3 event                                             
DEFAULT_INTERRUPT void I2C3_ER_IRQHandler()             { while (true); }   // I2C3 error                                             
DEFAULT_INTERRUPT void OTG_HS_EP1_OUT_IRQHandler()      { while (true); }   // USB OTG HS End Point 1 Out                      
DEFAULT_INTERRUPT void OTG_HS_EP1_IN_IRQHandler()       { while (true); }   // USB OTG HS End Point 1 In                       
DEFAULT_INTERRUPT void OTG_HS_WKUP_IRQHandler()         { while (true); }   // USB OTG HS Wakeup through EXTI                          
DEFAULT_INTERRUPT void OTG_HS_IRQHandler()              { while (true); }   // USB OTG HS                                      
DEFAULT_INTERRUPT void DCMI_IRQHandler()                { while (true); }   // DCMI                                                             
DEFAULT_INTERRUPT void RNG_IRQHandler()                 { while (true); }   // Rng                          
DEFAULT_INTERRUPT void FPU_IRQHandler()                 { while (true); }   // FPU                          
DEFAULT_INTERRUPT void UART7_IRQHandler()               { while (true); }   // UART7                              
DEFAULT_INTERRUPT void UART8_IRQHandler()               { while (true); }   // UART8                        
DEFAULT_INTERRUPT void SPI4_IRQHandler()                { while (true); }   // SPI4                         
DEFAULT_INTERRUPT void SPI5_IRQHandler()                { while (true); }   // SPI5                         
DEFAULT_INTERRUPT void SPI6_IRQHandler()                { while (true); }   // SPI6                         
DEFAULT_INTERRUPT void SAI1_IRQHandler()                { while (true); }   // SAI1                         
DEFAULT_INTERRUPT void LTDC_IRQHandler()                { while (true); }   // LTDC                         
DEFAULT_INTERRUPT void LTDC_ER_IRQHandler()             { while (true); }   // LTDC error                   
DEFAULT_INTERRUPT void DMA2D_IRQHandler()               { while (true); }   // DMA2D                        
DEFAULT_INTERRUPT void SAI2_IRQHandler()                { while (true); }   // SAI2                         
DEFAULT_INTERRUPT void QUADSPI_IRQHandler()             { while (true); }   // QUADSPI                      
DEFAULT_INTERRUPT void LPTIM1_IRQHandler()              { while (true); }   // LPTIM1                       
DEFAULT_INTERRUPT void CEC_IRQHandler()                 { while (true); }   // HDMI_CEC                     
DEFAULT_INTERRUPT void I2C4_EV_IRQHandler()             { while (true); }   // I2C4 Event                   
DEFAULT_INTERRUPT void I2C4_ER_IRQHandler()             { while (true); }   // I2C4 Error                   
DEFAULT_INTERRUPT void SPDIF_RX_IRQHandler()            { while (true); }   // SPDIF_RX                      
DEFAULT_INTERRUPT void OTG_FS_EP1_OUT_IRQHandler()      { while (true); }   // USB OTG FS End Point 1 Out      
DEFAULT_INTERRUPT void OTG_FS_EP1_IN_IRQHandler()       { while (true); }   // USB OTG FS End Point 1 In       
DEFAULT_INTERRUPT void OTG_FS_WKUP_IRQHandler()         { while (true); }   // USB OTG FS Wakeup through EXTI   
DEFAULT_INTERRUPT void OTG_FS_IRQHandler()              { while (true); }   // USB OTG FS                   
DEFAULT_INTERRUPT void DMAMUX1_OVR_IRQHandler()         { while (true); }   // DMAMUX1 Overrun interrupt      
DEFAULT_INTERRUPT void HRTIM1_Master_IRQHandler()       { while (true); }   // HRTIM Master Timer global Interrupt 
DEFAULT_INTERRUPT void HRTIM1_TIMA_IRQHandler()         { while (true); }   // HRTIM Timer A global Interrupt   
DEFAULT_INTERRUPT void HRTIM1_TIMB_IRQHandler()         { while (true); }   // HRTIM Timer B global Interrupt   
DEFAULT_INTERRUPT void HRTIM1_TIMC_IRQHandler()         { while (true); }   // HRTIM Timer C global Interrupt   
DEFAULT_INTERRUPT void HRTIM1_TIMD_IRQHandler()         { while (true); }   // HRTIM Timer D global Interrupt   
DEFAULT_INTERRUPT void HRTIM1_TIME_IRQHandler()         { while (true); }   // HRTIM Timer E global Interrupt   
DEFAULT_INTERRUPT void HRTIM1_FLT_IRQHandler()          { while (true); }   // HRTIM Fault global Interrupt    
DEFAULT_INTERRUPT void DFSDM1_FLT0_IRQHandler()         { while (true); }   // DFSDM Filter0 Interrupt        
DEFAULT_INTERRUPT void DFSDM1_FLT1_IRQHandler()         { while (true); }   // DFSDM Filter1 Interrupt             
DEFAULT_INTERRUPT void DFSDM1_FLT2_IRQHandler()         { while (true); }   // DFSDM Filter2 Interrupt            
DEFAULT_INTERRUPT void DFSDM1_FLT3_IRQHandler()         { while (true); }   // DFSDM Filter3 Interrupt           
DEFAULT_INTERRUPT void SAI3_IRQHandler()                { while (true); }   // SAI3 global Interrupt             
DEFAULT_INTERRUPT void SWPMI1_IRQHandler()              { while (true); }   // Serial Wire Interface 1 global interrupt 
DEFAULT_INTERRUPT void TIM15_IRQHandler()               { while (true); }   // TIM15 global Interrupt              
DEFAULT_INTERRUPT void TIM16_IRQHandler()               { while (true); }   // TIM16 global Interrupt            
DEFAULT_INTERRUPT void TIM17_IRQHandler()               { while (true); }   // TIM17 global Interrupt            
DEFAULT_INTERRUPT void MDIOS_WKUP_IRQHandler()          { while (true); }   // MDIOS Wakeup         
DEFAULT_INTERRUPT void MDIOS_IRQHandler()               { while (true); }   // MDIOS global Interrupt          
DEFAULT_INTERRUPT void JPEG_IRQHandler()                { while (true); }   // JPEG global Interrupt           
DEFAULT_INTERRUPT void MDMA_IRQHandler()                { while (true); }   // MDMA global Interrupt           
DEFAULT_INTERRUPT void SDMMC2_IRQHandler()              { while (true); }   // SDMMC2 global Interrupt         
DEFAULT_INTERRUPT void HSEM1_IRQHandler()               { while (true); }   // HSEM1 global Interrupt             
DEFAULT_INTERRUPT void ADC3_IRQHandler()                { while (true); }   // ADC3 global Interrupt           
DEFAULT_INTERRUPT void DMAMUX2_OVR_IRQHandler()         { while (true); }   // DMAMUX Overrun interrupt        
DEFAULT_INTERRUPT void BDMA_Channel0_IRQHandler()       { while (true); }   // BDMA Channel 0 global Interrupt 
DEFAULT_INTERRUPT void BDMA_Channel1_IRQHandler()       { while (true); }   // BDMA Channel 1 global Interrupt  
DEFAULT_INTERRUPT void BDMA_Channel2_IRQHandler()       { while (true); }   // BDMA Channel 2 global Interrupt  
DEFAULT_INTERRUPT void BDMA_Channel3_IRQHandler()       { while (true); }   // BDMA Channel 3 global Interrupt  
DEFAULT_INTERRUPT void BDMA_Channel4_IRQHandler()       { while (true); }   // BDMA Channel 4 global Interrupt  
DEFAULT_INTERRUPT void BDMA_Channel5_IRQHandler()       { while (true); }   // BDMA Channel 5 global Interrupt  
DEFAULT_INTERRUPT void BDMA_Channel6_IRQHandler()       { while (true); }   // BDMA Channel 6 global Interrupt  
DEFAULT_INTERRUPT void BDMA_Channel7_IRQHandler()       { while (true); }   // BDMA Channel 7 global Interrupt  
DEFAULT_INTERRUPT void COMP1_IRQHandler()               { while (true); }   // COMP1 global Interrupt               
DEFAULT_INTERRUPT void LPTIM2_IRQHandler()              { while (true); }   // LP TIM2 global interrupt         
DEFAULT_INTERRUPT void LPTIM3_IRQHandler()              { while (true); }   // LP TIM3 global interrupt        
DEFAULT_INTERRUPT void LPTIM4_IRQHandler()              { while (true); }   // LP TIM4 global interrupt        
DEFAULT_INTERRUPT void LPTIM5_IRQHandler()              { while (true); }   // LP TIM5 global interrupt        
DEFAULT_INTERRUPT void LPUART1_IRQHandler()             { while (true); }   // LP UART1 interrupt                  
DEFAULT_INTERRUPT void CRS_IRQHandler()                 { while (true); }   // Clock Recovery Global Interrupt  
DEFAULT_INTERRUPT void ECC_IRQHandler()                 { while (true); }   // ECC diagnostic Global Interrupt  
DEFAULT_INTERRUPT void SAI4_IRQHandler()                { while (true); }   // SAI4 global interrupt                
DEFAULT_INTERRUPT void WAKEUP_PIN_IRQHandler()          { while (true); }   // Interrupt for all 6 wake-up pins 

/*****************************************************************************/
/******** VECTOR TABLE LOCATED AT THE START OF THE FLASH MEMORY **************/
/*****************************************************************************/

